; domain
;; Woodworking
;;

(define (domain woodworking)
  (:requirements :typing :action-costs)
  (:types
      acolour awood woodobj machine 
      surface treatmentstatus
      aboardsize apartsize - object
      highspeed-saw glazer grinder immersion-varnisher
      planer saw spray-varnisher - machine
      board part - woodobj)

  (:constants
              verysmooth smooth rough - surface
              varnished glazed untreated colourfragments - treatmentstatus
              natural - acolour
              small medium large - apartsize)

  (:predicates 
            (unused ?obj - part)
            (available ?obj - woodobj)

            (surface-condition ?obj - woodobj ?surface - surface)
            (treatment ?obj - part ?treatment - treatmentstatus)
            (colour ?obj - part ?colour - acolour)
            (wood ?obj - woodobj ?wood - awood)
            (boardsize ?board - board ?size - aboardsize)
            (goalsize ?part - part ?size - apartsize)
            (boardsize-successor ?size1 ?size2 - aboardsize)

            (in-highspeed-saw ?b - board ?m - highspeed-saw)
            (empty ?m - highspeed-saw)
            (has-colour ?machine - machine ?colour - acolour)
            (contains-part ?b - board ?p - part)
            (grind-treatment-change ?old ?new - treatmentstatus)
            (is-smooth ?surface - surface))
      
  (:functions (total-cost) - number
            (spray-varnish-cost ?obj - part) - number
            (glaze-cost ?obj - part) - number
            (grind-cost ?obj - part) - number
            (plane-cost ?obj - part) - number)

  (:action do-immersion-varnish
    :parameters (?x - part ?m - immersion-varnisher 
                 ?newcolour - acolour ?surface - surface)
    :precondition (and
            (available ?x)
            (has-colour ?m ?newcolour)
            (surface-condition ?x ?surface)
            (is-smooth ?surface)
            (treatment ?x untreated))
    :effect (and
            (increase (total-cost) 10)
            (not (treatment ?x untreated))
            (treatment ?x varnished)
            (not (colour ?x natural))
            (colour ?x ?newcolour)))

  (:action do-spray-varnish
    :parameters (?x - part ?m - spray-varnisher 
                 ?newcolour - acolour ?surface - surface)
    :precondition (and
            (available ?x)
            (has-colour ?m ?newcolour)
            (surface-condition ?x ?surface)
            (is-smooth ?surface)
            (treatment ?x untreated))
    :effect (and 
            (increase (total-cost) (spray-varnish-cost ?x))
            (not (treatment ?x untreated))
            (treatment ?x varnished)
            (not (colour ?x natural))
            (colour ?x ?newcolour)))

  (:action do-glaze
    :parameters (?x - part ?m - glazer 
                 ?newcolour - acolour)
    :precondition (and
            (available ?x)
            (has-colour ?m ?newcolour)
            (treatment ?x untreated))
    :effect (and 
            (increase (total-cost) (glaze-cost ?x))
            (not (treatment ?x untreated))
            (treatment ?x glazed)
            (not (colour ?x natural))
            (colour ?x ?newcolour)))

  (:action do-grind
    :parameters (?x - part ?m - grinder ?oldsurface - surface
                 ?oldcolour - acolour 
                 ?oldtreatment ?newtreatment - treatmentstatus) 
    :precondition (and 
            (available ?x)
            (surface-condition ?x ?oldsurface)
            (is-smooth ?oldsurface)
            (colour ?x ?oldcolour)
            (treatment ?x ?oldtreatment)
            (grind-treatment-change ?oldtreatment ?newtreatment))
    :effect (and
            (increase (total-cost) (grind-cost ?x))
            (not (surface-condition ?x ?oldsurface))
            (surface-condition ?x verysmooth)
            (not (treatment ?x ?oldtreatment))
            (treatment ?x ?newtreatment)
            (not (colour ?x ?oldcolour))
            (colour ?x natural)))

  (:action do-plane
    :parameters (?x - part ?m - planer ?oldsurface - surface
                 ?oldcolour - acolour ?oldtreatment - treatmentstatus) 
    :precondition (and 
            (available ?x)
            (surface-condition ?x ?oldsurface)
            (treatment ?x ?oldtreatment)
            (colour ?x ?oldcolour))
    :effect (and
            (increase (total-cost) (plane-cost ?x))
            (not (surface-condition ?x ?oldsurface))
            (surface-condition ?x smooth)
            (not (treatment ?x ?oldtreatment))
            (treatment ?x untreated)
            (not (colour ?x ?oldcolour))
            (colour ?x natural)))

  (:action load-highspeed-saw
    :parameters (?b - board ?m - highspeed-saw)
    :precondition (and
            (empty ?m)
            (available ?b))
    :effect (and
            (increase (total-cost) 30)
            (not (available ?b))
            (not (empty ?m))
            (in-highspeed-saw ?b ?m)))
            
  (:action unload-highspeed-saw
    :parameters (?b - board ?m - highspeed-saw)
    :precondition (in-highspeed-saw ?b ?m)
    :effect (and
            (increase (total-cost) 10)
            (available ?b)
            (not (in-highspeed-saw ?b ?m))
            (empty ?m)))
            
  (:action cut-board-small
    :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                 ?surface - surface ?size_before ?size_after - aboardsize)
    :precondition (and
            (unused ?p)
            (goalsize ?p small)
            (in-highspeed-saw ?b ?m)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?size_before))
    :effect (and
            (increase (total-cost) 10)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural)
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action cut-board-medium
    :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?size_after - aboardsize)
    :precondition (and
            (unused ?p)
            (goalsize ?p medium)
            (in-highspeed-saw ?b ?m)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?size_before))
    :effect (and
            (increase (total-cost) 10)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural)
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action cut-board-large
    :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?s2 ?size_after - aboardsize)
    :precondition (and
            (unused ?p)
            (goalsize ?p large)
            (in-highspeed-saw ?b ?m)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?s2)
            (boardsize-successor ?s2 ?size_before))
    :effect (and
            (increase (total-cost) 10)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural)
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action do-saw-small
    :parameters (?b - board ?p - part ?m - saw ?w - awood
                 ?surface - surface ?size_before ?size_after - aboardsize) 
    :precondition (and 
            (unused ?p)
            (goalsize ?p small)
            (available ?b)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?size_before))
    :effect (and
            (increase (total-cost) 30)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural) 
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action do-saw-medium
    :parameters (?b - board ?p - part ?m - saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?size_after - aboardsize) 
    :precondition (and 
            (unused ?p)
            (goalsize ?p medium)
            (available ?b)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?size_before))
    :effect (and
            (increase (total-cost) 30)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural) 
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action do-saw-large
    :parameters (?b - board ?p - part ?m - saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?s2 ?size_after - aboardsize) 
    :precondition (and 
            (unused ?p)
            (goalsize ?p large)
            (available ?b)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?s2)
            (boardsize-successor ?s2 ?size_before))
    :effect (and
            (increase (total-cost) 30)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural) 
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))
)

; problem
; woodworking task with 12 parts and 100% wood
; Machines:
;   2 highspeed-saw
;   2 glazer
;   2 grinder
;   2 immersion-varnisher
;   2 planer
;   2 saw
;   2 spray-varnisher

(define (problem wood-prob)
  (:domain woodworking)
  (:objects
    highspeed-saw0 highspeed-saw1 - highspeed-saw
    glazer0 glazer1 - glazer
    grinder0 grinder1 - grinder
    immersion-varnisher0 immersion-varnisher1 - immersion-varnisher
    planer0 planer1 - planer
    saw0 saw1 - saw
    spray-varnisher0 spray-varnisher1 - spray-varnisher
    black red mauve white blue green - acolour
    walnut oak teak - awood
    p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 - part
    b0 b1 b2 - board
    s0 s1 s2 s3 s4 s5 s6 - aboardsize
  )
  (:init
    (grind-treatment-change varnished colourfragments)
    (grind-treatment-change glazed untreated)
    (grind-treatment-change untreated untreated)
    (grind-treatment-change colourfragments untreated)
    (is-smooth smooth)
    (is-smooth verysmooth)
    (= (total-cost) 0)
    (boardsize-successor s0 s1)
    (boardsize-successor s1 s2)
    (boardsize-successor s2 s3)
    (boardsize-successor s3 s4)
    (boardsize-successor s4 s5)
    (boardsize-successor s5 s6)
    (empty highspeed-saw0)
    (empty highspeed-saw1)
    (has-colour glazer0 natural)
    (has-colour glazer0 green)
    (has-colour glazer0 white)
    (has-colour glazer1 green)
    (has-colour glazer1 natural)
    (has-colour glazer1 black)
    (has-colour glazer1 blue)
    (has-colour glazer1 white)
    (has-colour immersion-varnisher0 black)
    (has-colour immersion-varnisher0 white)
    (has-colour immersion-varnisher1 blue)
    (has-colour immersion-varnisher1 white)
    (has-colour spray-varnisher0 black)
    (has-colour spray-varnisher0 blue)
    (has-colour spray-varnisher0 white)
    (has-colour spray-varnisher1 white)
    (available p0)
    (treatment p0 varnished)
    (surface-condition p0 verysmooth)
    (wood p0 walnut)
    (colour p0 blue)
    (goalsize p0 small)
    (= (spray-varnish-cost p0) 5)
    (= (glaze-cost p0) 10)
    (= (grind-cost p0) 15)
    (= (plane-cost p0) 10)
    (unused p1)
    (goalsize p1 small)
    (= (spray-varnish-cost p1) 5)
    (= (glaze-cost p1) 10)
    (= (grind-cost p1) 15)
    (= (plane-cost p1) 10)
    (unused p2)
    (goalsize p2 medium)
    (= (spray-varnish-cost p2) 10)
    (= (glaze-cost p2) 15)
    (= (grind-cost p2) 30)
    (= (plane-cost p2) 20)
    (available p3)
    (treatment p3 colourfragments)
    (surface-condition p3 verysmooth)
    (wood p3 teak)
    (colour p3 red)
    (goalsize p3 medium)
    (= (spray-varnish-cost p3) 10)
    (= (glaze-cost p3) 15)
    (= (grind-cost p3) 30)
    (= (plane-cost p3) 20)
    (unused p4)
    (goalsize p4 small)
    (= (spray-varnish-cost p4) 5)
    (= (glaze-cost p4) 10)
    (= (grind-cost p4) 15)
    (= (plane-cost p4) 10)
    (available p5)
    (treatment p5 glazed)
    (surface-condition p5 rough)
    (wood p5 oak)
    (colour p5 green)
    (goalsize p5 large)
    (= (spray-varnish-cost p5) 15)
    (= (glaze-cost p5) 20)
    (= (grind-cost p5) 45)
    (= (plane-cost p5) 30)
    (available p6)
    (treatment p6 colourfragments)
    (surface-condition p6 rough)
    (wood p6 oak)
    (colour p6 white)
    (goalsize p6 medium)
    (= (spray-varnish-cost p6) 10)
    (= (glaze-cost p6) 15)
    (= (grind-cost p6) 30)
    (= (plane-cost p6) 20)
    (unused p7)
    (goalsize p7 medium)
    (= (spray-varnish-cost p7) 10)
    (= (glaze-cost p7) 15)
    (= (grind-cost p7) 30)
    (= (plane-cost p7) 20)
    (unused p8)
    (goalsize p8 large)
    (= (spray-varnish-cost p8) 15)
    (= (glaze-cost p8) 20)
    (= (grind-cost p8) 45)
    (= (plane-cost p8) 30)
    (unused p9)
    (goalsize p9 large)
    (= (spray-varnish-cost p9) 15)
    (= (glaze-cost p9) 20)
    (= (grind-cost p9) 45)
    (= (plane-cost p9) 30)
    (available p10)
    (treatment p10 colourfragments)
    (surface-condition p10 verysmooth)
    (wood p10 oak)
    (colour p10 blue)
    (goalsize p10 small)
    (= (spray-varnish-cost p10) 5)
    (= (glaze-cost p10) 10)
    (= (grind-cost p10) 15)
    (= (plane-cost p10) 10)
    (unused p11)
    (goalsize p11 medium)
    (= (spray-varnish-cost p11) 10)
    (= (glaze-cost p11) 15)
    (= (grind-cost p11) 30)
    (= (plane-cost p11) 20)
    (boardsize b0 s6)
    (wood b0 oak)
    (surface-condition b0 rough)
    (available b0)
    (boardsize b1 s2)
    (wood b1 teak)
    (surface-condition b1 rough)
    (available b1)
    (boardsize b2 s6)
    (wood b2 walnut)
    (surface-condition b2 rough)
    (available b2)
  )
  (:goal
    (and
    (available p0)
    (treatment p0 glazed)
    (surface-condition p0 verysmooth)
    (available p1)
    (treatment p1 varnished)
    (wood p1 oak)
    (available p2)
    (colour p2 white)
    (treatment p2 varnished)
    (surface-condition p2 verysmooth)
    (available p3)
    (colour p3 natural)
    (treatment p3 glazed)
    (wood p3 teak)
    (surface-condition p3 smooth)
    (available p4)
    (treatment p4 glazed)
    (surface-condition p4 verysmooth)
    (available p5)
    (wood p5 oak)
    (surface-condition p5 verysmooth)
    (available p6)
    (colour p6 black)
    (wood p6 oak)
    (available p7)
    (colour p7 blue)
    (surface-condition p7 smooth)
    (available p8)
    (treatment p8 glazed)
    (wood p8 walnut)
    (surface-condition p8 smooth)
    (available p9)
    (colour p9 green)
    (treatment p9 glazed)
    (available p10)
    (treatment p10 glazed)
    (wood p10 oak)
    (available p11)
    (colour p11 white)
    (treatment p11 glazed)
    (wood p11 walnut)
    (surface-condition p11 verysmooth)
    )
  )
  (:metric minimize (total-cost))
)

; plan
1. (do-saw-small b2 p4 saw0 walnut rough s6 s5)
   deleted: (unused p4)
   added: (available p4) (wood p4 walnut) (surface-condition p4 rough) (colour p4 natural) (treatment p4 untreated) (boardsize b2 s5)
   goals met: 11 of 42
2. (do-saw-medium b2 p11 saw0 walnut rough s5 s4 s3)
   deleted: (unused p11)
   added: (available p11) (wood p11 walnut) (surface-condition p11 rough) (colour p11 natural) (treatment p11 untreated) (boardsize b2 s3)
   goals met: 13 of 42
3. (do-saw-medium b0 p7 saw0 oak rough s6 s5 s4)
   deleted: (unused p7)
   added: (available p7) (wood p7 oak) (surface-condition p7 rough) (colour p7 natural) (treatment p7 untreated) (boardsize b0 s4)
   goals met: 14 of 42
4. (do-saw-large b0 p9 saw0 oak rough s4 s2 s3 s1)
   deleted: (unused p9)
   added: (available p9) (wood p9 oak) (surface-condition p9 rough) (colour p9 natural) (treatment p9 untreated) (boardsize b0 s1)
   goals met: 15 of 42
5. (do-plane p7 planer0 rough natural untreated)
   deleted: (surface-condition p7 rough)
   added: (surface-condition p7 smooth)
   goals met: 16 of 42
6. (do-plane p6 planer0 rough white colourfragments)
   deleted: (surface-condition p6 rough) (treatment p6 colourfragments) (colour p6 white)
   added: (surface-condition p6 smooth) (treatment p6 untreated) (colour p6 natural)
   goals met: 16 of 42
7. (do-plane p4 planer0 rough natural untreated)
   deleted: (surface-condition p4 rough)
   added: (surface-condition p4 smooth)
   goals met: 16 of 42
8. (do-plane p3 planer0 verysmooth red colourfragments)
   deleted: (surface-condition p3 verysmooth) (treatment p3 colourfragments) (colour p3 red)
   added: (surface-condition p3 smooth) (treatment p3 untreated) (colour p3 natural)
   goals met: 18 of 42
9. (do-plane p11 planer0 rough natural untreated)
   deleted: (surface-condition p11 rough)
   added: (surface-condition p11 smooth)
   goals met: 18 of 42
10. (do-plane p0 planer0 verysmooth blue varnished)
   deleted: (surface-condition p0 verysmooth) (treatment p0 varnished) (colour p0 blue)
   added: (surface-condition p0 smooth) (treatment p0 untreated) (colour p0 natural)
   goals met: 17 of 42
11. (do-grind p4 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p4 smooth)
   added: (surface-condition p4 verysmooth)
   goals met: 18 of 42
12. (do-grind p11 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p11 smooth)
   added: (surface-condition p11 verysmooth)
   goals met: 19 of 42
13. (do-grind p10 grinder0 verysmooth blue colourfragments untreated)
   deleted: (treatment p10 colourfragments) (colour p10 blue)
   added: (treatment p10 untreated) (colour p10 natural)
   goals met: 19 of 42
14. (do-grind p0 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p0 smooth)
   added: (surface-condition p0 verysmooth)
   goals met: 20 of 42
15. (do-glaze p9 glazer0 green)
   deleted: (treatment p9 untreated) (colour p9 natural)
   added: (treatment p9 glazed) (colour p9 green)
   goals met: 22 of 42
16. (do-glaze p7 glazer1 blue)
   deleted: (treatment p7 untreated) (colour p7 natural)
   added: (treatment p7 glazed) (colour p7 blue)
   goals met: 23 of 42
17. (do-glaze p6 glazer1 black)
   deleted: (treatment p6 untreated) (colour p6 natural)
   added: (treatment p6 glazed) (colour p6 black)
   goals met: 24 of 42
18. (do-glaze p4 glazer0 green)
   deleted: (treatment p4 untreated) (colour p4 natural)
   added: (treatment p4 glazed) (colour p4 green)
   goals met: 25 of 42
19. (do-glaze p3 glazer0 natural)
   deleted: (treatment p3 untreated)
   added: (treatment p3 glazed)
   goals met: 26 of 42
20. (do-glaze p11 glazer0 white)
   deleted: (treatment p11 untreated) (colour p11 natural)
   added: (treatment p11 glazed) (colour p11 white)
   goals met: 28 of 42
21. (do-glaze p10 glazer0 green)
   deleted: (treatment p10 untreated) (colour p10 natural)
   added: (treatment p10 glazed) (colour p10 green)
   goals met: 29 of 42
22. (do-glaze p0 glazer0 green)
   deleted: (treatment p0 untreated) (colour p0 natural)
   added: (treatment p0 glazed) (colour p0 green)
   goals met: 30 of 42
23. (do-plane p5 planer0 rough green glazed)
   deleted: (surface-condition p5 rough) (treatment p5 glazed) (colour p5 green)
   added: (surface-condition p5 smooth) (treatment p5 untreated) (colour p5 natural)
   goals met: 30 of 42
24. (do-grind p5 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p5 smooth)
   added: (surface-condition p5 verysmooth)
   goals met: 31 of 42
25. (do-saw-large b2 p8 saw0 walnut rough s3 s1 s2 s0)
   deleted: (unused p8)
   added: (available p8) (wood p8 walnut) (surface-condition p8 rough) (colour p8 natural) (treatment p8 untreated) (boardsize b2 s0)
   goals met: 33 of 42
26. (do-plane p8 planer0 rough natural untreated)
   deleted: (surface-condition p8 rough)
   added: (surface-condition p8 smooth)
   goals met: 34 of 42
27. (do-glaze p8 glazer0 green)
   deleted: (treatment p8 untreated) (colour p8 natural)
   added: (treatment p8 glazed) (colour p8 green)
   goals met: 35 of 42
28. (do-saw-medium b1 p2 saw0 teak rough s2 s1 s0)
   deleted: (unused p2)
   added: (available p2) (wood p2 teak) (surface-condition p2 rough) (colour p2 natural) (treatment p2 untreated) (boardsize b1 s0)
   goals met: 36 of 42
29. (do-plane p2 planer0 rough natural untreated)
   deleted: (surface-condition p2 rough)
   added: (surface-condition p2 smooth)
   goals met: 36 of 42
30. (do-grind p2 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p2 smooth)
   added: (surface-condition p2 verysmooth)
   goals met: 37 of 42
31. (do-immersion-varnish p2 immersion-varnisher0 white verysmooth)
   deleted: (treatment p2 untreated) (colour p2 natural)
   added: (treatment p2 varnished) (colour p2 white)
   goals met: 39 of 42
32. (do-saw-small b0 p1 saw0 oak rough s1 s0)
   deleted: (unused p1)
   added: (available p1) (wood p1 oak) (surface-condition p1 rough) (colour p1 natural) (treatment p1 untreated) (boardsize b0 s0)
   goals met: 41 of 42
33. (do-plane p1 planer0 rough natural untreated)
   deleted: (surface-condition p1 rough)
   added: (surface-condition p1 smooth)
   goals met: 41 of 42
34. (do-immersion-varnish p1 immersion-varnisher0 black smooth)
   deleted: (treatment p1 untreated) (colour p1 natural)
   added: (treatment p1 varnished) (colour p1 black)
   goals met: 42 of 42
